code_igniter/app/Controllers/Articulo.php

INSERT INTO `articulo` (`title`, `descripcion`, `cuerpo`) VALUES ('Articulo 2', 'pruebas', 'Soy el articulo numero 2')
---
    public function create()
    {
        $model = new ArticuloModel();

        if(
            $this->request->getMethod()=='post'
            &&
            $this->validate(
                [
                    'title' =>'required|min_length[3]|max_length[255]',
                    'descripcion' => 'required',
                    'cuerpo' => 'required'
                ]
            )
        ){

            $model->save([
                'title'=> $this->request->getPost('title'),
                'descripcion'=> $this->request->getPost('descripcion'),
                'cuerpo' => $this->request->getPost('cuerpo')
            ]);