code_igniter/app/Models/ArticuloModel.php

SELECT *
FROM `articulo`
SELECT *
FROM `articulo`
WHERE `id` = '1'
 LIMIT 1
---
        public function getArticulos($id = false)
        {
            if($id === false){
                return $this->findAll();
            }

            return $this->asArray()->where(['id' => $id])->first();