code_igniter/app/Models/UsuarioModel.php

    public function getUser($u)
    {
        return $this->asArray()
                    ->where(['user' => $u])
                     ->first();
---
SELECT *
FROM `usuario`
WHERE `user` = 'ara'
 LIMIT 1